#+TITLE: site index
* Articles
  - [[file:for-the-want-of-a-slash.org][For the want of a slash]]
  - [[file:javascript-primes.org][Javascript primes]]
  - [[file:gaussian-prime-spirals.org][Gaussian prime spirals]]

* To Do                                                            :noexport:
* export                                                           :noexport:
#+begin_src emacs-lisp
(setq org-publish-project-alist
      '(("idiocy.org"
         :components ("blog-content" "blog-static"))
        ("blog-content"
         :base-directory "."
         :base-extension "org"
         ;;:publishing-directory "/ssh:alan@idiocy.org:/www/idiocy.org/htdocs/"
         :publishing-directory "./build"
         :recursive t
         :publishing-function (org-html-publish-to-html)
         :with-tags nil
         :headline-levels 4             ; Just the default for this project.
         :with-toc nil
         :section-numbers nil
         :with-sub-superscript nil
         :with-todo-keywords nil
         :with-author t
         :with-email t
         :with-creator nil
         :html-doctype "html5"
         :html-html5-fancy t
         :html-preamble "idiocy.org"
         ;;:html-postamble nil
         :html-head "<link rel='stylesheet' type='text/css' href='common/idiocy.css'>"
         :with-timestamp t
         :exclude-tags ("noexport" "todo"))
        ("blog-static"
         :base-directory "."
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|svg\\|pdf\\|mp3\\|ogg"
         ;;:publishing-directory "/ssh:alan@idiocy.org:/www/idiocy.org/htdocs/"
         :publishing-directory "./build"
         :recursive t
         :exclude "./build"
         :publishing-function org-publish-attachment)))

; (defun my-org-html-postamble (plist)
;  (format "Last update: %s" (format-time-string "%d %b %Y")))
; (setq org-html-postamble 'my-org-html-postamble)

(org-publish-current-project)
#+end_src

#+RESULTS:
| blog-content | :base-directory | . | :base-extension | org  | :publishing-directory | ./build | :recursive | t    | :publishing-function | (org-html-publish-to-html) | :with-tags | nil | :headline-levels      |       4 | :with-toc  | nil | :section-numbers | nil     | :with-sub-superscript | nil                    | :with-todo-keywords | nil | :with-author | t | :with-email | t | :with-creator | nil | :html-doctype | html5 | :html-html5-fancy | t | :html-preamble | idiocy.org | :html-head | <link rel='stylesheet' type='text/css' href='common/idiocy.css'> | :with-timestamp | t | :exclude-tags | (noexport todo) |
| blog-static  | :base-directory | . | :base-extension | css\ | js\                   | png\    | jpg\       | gif\ | svg\                 | pdf\                       | mp3\       | ogg | :publishing-directory | ./build | :recursive | t   | :exclude         | ./build | :publishing-function  | org-publish-attachment |                     |     |              |   |             |   |               |     |               |       |                   |   |                |            |            |                                                                  |                 |   |               |                 |

